apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2g4.h
/****************************************************************************
 * arch/arm/src/common/stm32/hardware/stm32_adc_v2g4.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 *  Licensed to the Apache Software Foundation (ASF) under one or more
 *  contributor license agreements.  See the NOTICE file distributed with
 *  this work for additional information regarding copyright ownership.  The
 *  ASF licenses this file to you under the Apache License, Version 2.0 (the
 *  "License"); you may not use this file except in compliance with the
 *  License.  You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 *  License for the specific language governing permissions and limitations
 *  under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_ADC_V2G4_H
#define __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_ADC_V2G4_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#define HAVE_IP_ADC_V2
#undef HAVE_IP_ADC_V1           /* No ADC IPv1 */
#undef HAVE_ADC_CLOCK_HSI       /* No ADC clock from HSI */
#undef HAVE_ADC_POWERDOWN       /* No ADC power down */
#define HAVE_ADC_VBAT           /* VBAT channel support */
#undef HAVE_BASIC_ADC

/* Base addresses ***********************************************************/

#define STM32_ADC1_OFFSET              0x0000
#define STM32_ADC2_OFFSET              0x0100
#define STM32_ADC3_OFFSET              0x0000
#define STM32_ADC4_OFFSET              0x0100
#define STM32_ADC5_OFFSET              0x0200
#define STM32_ADCCMN_OFFSET            0x0300

#define STM32_ADC1_BASE                (STM32_ADC12_BASE + STM32_ADC1_OFFSET)    /* ADC1 Master ADC */
#define STM32_ADC2_BASE                (STM32_ADC12_BASE + STM32_ADC2_OFFSET)    /* ADC2 Slave ADC */
#define STM32_ADC12CMN_BASE            (STM32_ADC12_BASE + STM32_ADCCMN_OFFSET)  /* ADC1, ADC2 common */
#define STM32_ADC3_BASE                (STM32_ADC345_BASE + STM32_ADC3_OFFSET)   /* ADC3 Master ADC */
#define STM32_ADC4_BASE                (STM32_ADC345_BASE + STM32_ADC4_OFFSET)   /* ADC4 Slave ADC */
#define STM32_ADC5_BASE                (STM32_ADC345_BASE + STM32_ADC5_OFFSET)   /* ADC4 Slave ADC */
#define STM32_ADC345CMN_BASE           (STM32_ADC345_BASE + STM32_ADCCMN_OFFSET) /* ADC3, ADC4 common */

/* Compatibility defines */

#define STM32_ADC34CMN_BASE            STM32_ADC345CMN_BASE

/* Register Offsets *********************************************************/

/* Registers for Each ADC */

#define STM32_ADC_ISR_OFFSET           0x0000                         /* ADC Interrupt and Status register */
#define STM32_ADC_IER_OFFSET           0x0004                         /* ADC Interrupt Enable register */
#define STM32_ADC_CR_OFFSET            0x0008                         /* ADC Control register */
#define STM32_ADC_CFGR1_OFFSET         0x000c                         /* ADC Configuration register 1 */
#define STM32_ADC_CFGR2_OFFSET         0x0010                         /* ADC Configuration register 2 */
#define STM32_ADC_SMPR1_OFFSET         0x0014                         /* ADC Sample Time register 1 */
#define STM32_ADC_SMPR2_OFFSET         0x0018                         /* ADC Sample Time register 2 */
#define STM32_ADC_TR1_OFFSET           0x0020                         /* ADC Watchdog Threshold register 1 */
#define STM32_ADC_TR2_OFFSET           0x0024                         /* ADC Watchdog Threshold register 2 */
#define STM32_ADC_TR3_OFFSET           0x0028                         /* ADC Watchdog Threshold register 3 */
#define STM32_ADC_SQR1_OFFSET          0x0030                         /* ADC Regular Sequence register 1 */
#define STM32_ADC_SQR2_OFFSET          0x0034                         /* ADC Regular Sequence register 2 */
#define STM32_ADC_SQR3_OFFSET          0x0038                         /* ADC Regular Sequence register 3 */
#define STM32_ADC_SQR4_OFFSET          0x003c                         /* ADC Regular Sequence register 4 */
#define STM32_ADC_DR_OFFSET            0x0040                         /* ADC Regular data register */
#define STM32_ADC_JSQR_OFFSET          0x004c                         /* ADC Injected Sequence register */
#define STM32_ADC_OFR1_OFFSET          0x0060                         /* ADC Offset register 1 */
#define STM32_ADC_OFR2_OFFSET          0x0064                         /* ADC Offset register 2 */
#define STM32_ADC_OFR3_OFFSET          0x0068                         /* ADC Offset register 3 */
#define STM32_ADC_OFR4_OFFSET          0x006c                         /* ADC Offset register 4 */
#define STM32_ADC_JDR1_OFFSET          0x0080                         /* ADC Injected Data register 1 */
#define STM32_ADC_JDR2_OFFSET          0x0084                         /* ADC Injected Data register 2 */
#define STM32_ADC_JDR3_OFFSET          0x0088                         /* ADC Injected Data register 3 */
#define STM32_ADC_JDR4_OFFSET          0x008c                         /* ADC Injected Data register 4 */
#define STM32_ADC_AWD2CR_OFFSET        0x00a0                         /* ADC Analog Watchdog 2 Configuration register */
#define STM32_ADC_AWD3CR_OFFSET        0x00a4                         /* ADC Analog Watchdog 3 Configuration register */
#define STM32_ADC_DIFSEL_OFFSET        0x00b0                         /* ADC Differential Mode Selection register */
#define STM32_ADC_CALFACT_OFFSET       0x00b4                         /* ADC Calibration Factors register */
#define STM32_ADC_GCOMP_OFFSET         0x00c0                         /* ADC Gain compensation register */

/* Master and Slave ADC Common Registers */

#define STM32_ADC_CSR_OFFSET           0x0000                         /* Common Status register */
#define STM32_ADC_CCR_OFFSET           0x0008                         /* Common Control register */
#define STM32_ADC_CDR_OFFSET           0x000c                         /* Common Regular Data Register for Dual Mode */

