apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2g4.h
#if STM32_NADC > 3
#  define STM32_ADC4_ISR               (STM32_ADC4_BASE + STM32_ADC_ISR_OFFSET)
#  define STM32_ADC4_IER               (STM32_ADC4_BASE + STM32_ADC_IER_OFFSET)
#  define STM32_ADC4_CR                (STM32_ADC4_BASE + STM32_ADC_CR_OFFSET)
#  define STM32_ADC4_CFGR1             (STM32_ADC4_BASE + STM32_ADC_CFGR1_OFFSET)
#  define STM32_ADC4_CFGR2             (STM32_ADC4_BASE + STM32_ADC_CFGR2_OFFSET)
#  define STM32_ADC4_SMPR1             (STM32_ADC4_BASE + STM32_ADC_SMPR1_OFFSET)
#  define STM32_ADC4_SMPR2             (STM32_ADC4_BASE + STM32_ADC_SMPR2_OFFSET)
#  define STM32_ADC4_TR1               (STM32_ADC4_BASE + STM32_ADC_TR1_OFFSET)
#  define STM32_ADC4_TR2               (STM32_ADC4_BASE + STM32_ADC_TR2_OFFSET)
#  define STM32_ADC4_TR3               (STM32_ADC4_BASE + STM32_ADC_TR3_OFFSET)
#  define STM32_ADC4_SQR1              (STM32_ADC4_BASE + STM32_ADC_SQR1_OFFSET)
#  define STM32_ADC4_SQR2              (STM32_ADC4_BASE + STM32_ADC_SQR2_OFFSET)
#  define STM32_ADC4_SQR3              (STM32_ADC4_BASE + STM32_ADC_SQR3_OFFSET)
#  define STM32_ADC4_SQR4              (STM32_ADC4_BASE + STM32_ADC_SQR4_OFFSET)
#  define STM32_ADC4_DR                (STM32_ADC4_BASE + STM32_ADC_DR_OFFSET)
#  define STM32_ADC4_JSQR              (STM32_ADC4_BASE + STM32_ADC_JSQR_OFFSET)
#  define STM32_ADC4_OFR1              (STM32_ADC4_BASE + STM32_ADC_OFR1_OFFSET)
#  define STM32_ADC4_OFR2              (STM32_ADC4_BASE + STM32_ADC_OFR2_OFFSET)
#  define STM32_ADC4_OFR3              (STM32_ADC4_BASE + STM32_ADC_OFR3_OFFSET)
#  define STM32_ADC4_OFR4              (STM32_ADC4_BASE + STM32_ADC_OFR4_OFFSET)
#  define STM32_ADC4_JDR1              (STM32_ADC4_BASE + STM32_ADC_JDR1_OFFSET)
#  define STM32_ADC4_JDR2              (STM32_ADC4_BASE + STM32_ADC_JDR2_OFFSET)
#  define STM32_ADC4_JDR3              (STM32_ADC4_BASE + STM32_ADC_JDR3_OFFSET)
#  define STM32_ADC4_JDR4              (STM32_ADC4_BASE + STM32_ADC_JDR4_OFFSET)
#  define STM32_ADC4_AWD2CR            (STM32_ADC4_BASE + STM32_ADC_AWD2CR_OFFSET)
#  define STM32_ADC4_AWD3CR            (STM32_ADC4_BASE + STM32_ADC_AWD3CR_OFFSET)
#  define STM32_ADC4_DIFSEL            (STM32_ADC4_BASE + STM32_ADC_DIFSEL_OFFSET)
#  define STM32_ADC4_CALFACT           (STM32_ADC4_BASE + STM32_ADC_CALFACT_OFFSET)
#  define STM32_ADC4_GCOMP             (STM32_ADC4_BASE + STM32_ADC_GCOMP_OFFSET)
#endif

#if STM32_NADC > 4
#  define STM32_ADC5_ISR               (STM32_ADC5_BASE + STM32_ADC_ISR_OFFSET)
#  define STM32_ADC5_IER               (STM32_ADC5_BASE + STM32_ADC_IER_OFFSET)
#  define STM32_ADC5_CR                (STM32_ADC5_BASE + STM32_ADC_CR_OFFSET)
#  define STM32_ADC5_CFGR1             (STM32_ADC5_BASE + STM32_ADC_CFGR1_OFFSET)
#  define STM32_ADC5_CFGR2             (STM32_ADC5_BASE + STM32_ADC_CFGR2_OFFSET)
#  define STM32_ADC5_SMPR1             (STM32_ADC5_BASE + STM32_ADC_SMPR1_OFFSET)
#  define STM32_ADC5_SMPR2             (STM32_ADC5_BASE + STM32_ADC_SMPR2_OFFSET)
#  define STM32_ADC5_TR1               (STM32_ADC5_BASE + STM32_ADC_TR1_OFFSET)
#  define STM32_ADC5_TR2               (STM32_ADC5_BASE + STM32_ADC_TR2_OFFSET)
#  define STM32_ADC5_TR3               (STM32_ADC5_BASE + STM32_ADC_TR3_OFFSET)
#  define STM32_ADC5_SQR1              (STM32_ADC5_BASE + STM32_ADC_SQR1_OFFSET)
#  define STM32_ADC5_SQR2              (STM32_ADC5_BASE + STM32_ADC_SQR2_OFFSET)
#  define STM32_ADC5_SQR3              (STM32_ADC5_BASE + STM32_ADC_SQR3_OFFSET)
#  define STM32_ADC5_SQR4              (STM32_ADC5_BASE + STM32_ADC_SQR4_OFFSET)
#  define STM32_ADC5_DR                (STM32_ADC5_BASE + STM32_ADC_DR_OFFSET)
#  define STM32_ADC5_JSQR              (STM32_ADC5_BASE + STM32_ADC_JSQR_OFFSET)
#  define STM32_ADC5_OFR1              (STM32_ADC5_BASE + STM32_ADC_OFR1_OFFSET)
#  define STM32_ADC5_OFR2              (STM32_ADC5_BASE + STM32_ADC_OFR2_OFFSET)
#  define STM32_ADC5_OFR3              (STM32_ADC5_BASE + STM32_ADC_OFR3_OFFSET)
#  define STM32_ADC5_OFR4              (STM32_ADC5_BASE + STM32_ADC_OFR4_OFFSET)
#  define STM32_ADC5_JDR1              (STM32_ADC5_BASE + STM32_ADC_JDR1_OFFSET)
#  define STM32_ADC5_JDR2              (STM32_ADC5_BASE + STM32_ADC_JDR2_OFFSET)
#  define STM32_ADC5_JDR3              (STM32_ADC5_BASE + STM32_ADC_JDR3_OFFSET)
#  define STM32_ADC5_JDR4              (STM32_ADC5_BASE + STM32_ADC_JDR4_OFFSET)
#  define STM32_ADC5_AWD2CR            (STM32_ADC5_BASE + STM32_ADC_AWD2CR_OFFSET)
#  define STM32_ADC5_AWD3CR            (STM32_ADC5_BASE + STM32_ADC_AWD3CR_OFFSET)
#  define STM32_ADC5_DIFSEL            (STM32_ADC5_BASE + STM32_ADC_DIFSEL_OFFSET)
#  define STM32_ADC5_CALFACT           (STM32_ADC5_BASE + STM32_ADC_CALFACT_OFFSET)
#  define STM32_ADC5_GCOMP             (STM32_ADC5_BASE + STM32_ADC_GCOMP_OFFSET)
#endif

/* Master and Slave ADC Common Registers */

#if STM32_NADC > 0
#  define STM32_ADC12_CSR              (STM32_ADC12CMN_BASE + STM32_ADC_CSR_OFFSET)
#  define STM32_ADC12_CCR              (STM32_ADC12CMN_BASE + STM32_ADC_CCR_OFFSET)
#  define STM32_ADC12_CDR              (STM32_ADC12CMN_BASE + STM32_ADC_CDR_OFFSET)
#endif

#if STM32_NADC > 2
#  define STM32_ADC345_CSR             (STM32_ADC345CMN_BASE + STM32_ADC_CSR_OFFSET)
#  define STM32_ADC345_CCR             (STM32_ADC345CMN_BASE + STM32_ADC_CCR_OFFSET)
#  define STM32_ADC345_CDR             (STM32_ADC345CMN_BASE + STM32_ADC_CDR_OFFSET)

/* Compatibility defines */

#  define STM32_ADC34_CSR              STM32_ADC345_CSR
#  define STM32_ADC34_CCR              STM32_ADC345_CCR
#  define STM32_ADC34_CDR              STM32_ADC345_CDR
#endif

/* Register Bitfield Definitions ********************************************/

/* ADC Interrupt and Status Register (ISR), and
 * ADC Interrupt Enable Register (IER)
 */

#define ADC_INT_ARDY                   (1 << 0)                       /* Bit 0:  ADC ready */
#define ADC_INT_EOSMP                  (1 << 1)                       /* Bit 1:  End of sampling flag */
#define ADC_INT_EOC                    (1 << 2)                       /* Bit 2:  End of conversion */
#define ADC_INT_EOS                    (1 << 3)                       /* Bit 3:  End of regular sequence flag */
#define ADC_INT_OVR                    (1 << 4)                       /* Bit 4:  Overrun */
#define ADC_INT_JEOC                   (1 << 5)                       /* Bit 5:  Injected channel end of conversion */
#define ADC_INT_JEOS                   (1 << 6)                       /* Bit 6:  Injected channel end of sequence flag */
#define ADC_INT_AWD1                   (1 << 7)                       /* Bit 7:  Analog watchdog 1 flag */
#define ADC_INT_AWD2                   (1 << 8)                       /* Bit 8:  Analog watchdog 2 flag */
#define ADC_INT_AWD3                   (1 << 9)                       /* Bit 9:  Analog watchdog 3 flag */
#define ADC_INT_JQOVF                  (1 << 10)                      /* Bit 10: Injected context queue overflow */

