apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2g4.h
/* ADC Control Register (CR) */

#define ADC_CR_ADEN                    (1 << 0)                       /* Bit 0:  ADC enable control */
#define ADC_CR_ADDIS                   (1 << 1)                       /* Bit 1:  ADC disable command */
#define ADC_CR_ADSTART                 (1 << 2)                       /* Bit 2:  ADC start of regular conversion */
#define ADC_CR_JADSTART                (1 << 3)                       /* Bit 3:  ADC start of injected conversion */
#define ADC_CR_ADSTP                   (1 << 4)                       /* Bit 4:  ADC stop of regular conversion command */
#define ADC_CR_JADSTP                  (1 << 5)                       /* Bit 5:  ADC stop of injected conversion command */
#define ADC_CR_ADVREGEN                (1 << 28)                      /* Bit 28: ADC voltage regulator enable */
#define ADC_CR_DEEPPWD                 (1 << 29)                      /* Bit 29: ADC deep power-down enable */
#define ADC_CR_ADCALDIF                (1 << 30)                      /* Bit 30: Differential mode for calibration */
#define ADC_CR_ADCAL                   (1 << 31)                      /* Bit 31: ADC calibration */

/* For compliance with the ADC driver we also define ADVREGEN like
 * for previous chips. For new chips ST decided to better describe
 * the mechanism behind ADVREGEN bits.
 */

#define ADC_CR_ADVREGEN_SHIFT          (28)
#define ADC_CR_ADVREGEN_MASK           (3 << ADC_CR_ADVREGEN_SHIFT)
#  define ADC_CR_ADVREGEN_INTER        (0 << ADC_CR_ADVREGEN_SHIFT)
#  define ADC_CR_ADVREGEN_ENABLED      (1 << ADC_CR_ADVREGEN_SHIFT)
#  define ADC_CR_ADVREGEN_DISABLED     (2 << ADC_CR_ADVREGEN_SHIFT)

/* ADC configuration register 1 (CFGR1) */

#define ADC_CFGR1_DMAEN                (1 << 0)                       /* Bit 0:  Direct memory access enable */
#define ADC_CFGR1_DMACFG               (1 << 1)                       /* Bit 1:  Direct memory access configuration */
#define ADC_CFGR1_RES_SHIFT            (3)                            /* Bits 3-4: Data resolution */
#define ADC_CFGR1_RES_MASK             (0x3 << ADC_CFGR1_RES_SHIFT)
#  define ADC_CFGR1_RES_12BIT          (0x0 << ADC_CFGR1_RES_SHIFT)   /* 12-bit resolution */
#  define ADC_CFGR1_RES_10BIT          (0x1 << ADC_CFGR1_RES_SHIFT)   /* 10-bit resolution */
#  define ADC_CFGR1_RES_8BIT           (0x2 << ADC_CFGR1_RES_SHIFT)   /* 8-bit resolution */
#  define ADC_CFGR1_RES_6BIT           (0x3 << ADC_CFGR1_RES_SHIFT)   /* 6-bit resolution */
#define ADC_CFGR1_EXTSEL_SHIFT         (5)                            /* Bits 5-9: External trigger selection for regular group */
#define ADC_CFGR1_EXTSEL_MASK          (0x1f << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1CC1     (0 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1CC2     (1 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1CC3     (2 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T2CC2     (3 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T3TRGO    (4 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T4CC4     (5 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_EXTI11    (6 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T8TRGO    (7 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T8TRGO2   (8 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1TRGO    (9 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1TRGO2   (10 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T2TRGO    (11 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T4TRGO    (12 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T6TRGO    (13 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T15TRGO   (14 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T3CC4     (15 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T20TRGO   (16 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T20TRGO2  (17 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T20CC1    (18 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T20CC2    (19 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T20CC3    (20 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG1  (21 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG3  (22 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG5  (23 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG6  (24 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG7  (25 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG8  (26 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG9  (27 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_HRT1TRG10 (28 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_LPTIMOUT  (29 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T7TRGO    (30 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_RSVD1     (31 << ADC_CFGR1_EXTSEL_SHIFT) /* 11111: Reserved */
#  define ADC34_CFGR1_EXTSEL_T3CC1     (0 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T2CC3     (1 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T1CC3     (2 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T8CC1     (3 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T3TRGO    (4 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_EXTI2     (5 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T4CC1     (6 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T8TRGO    (7 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T8TRGO2   (8 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T1TRGO    (9 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T1TRGO2   (10 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T2TRGO    (11 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T4TRGO    (12 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T6TRGO    (13 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T15TRGO   (14 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T2CC1     (15 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T20TRGO   (16 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T20TRGO2  (17 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T20CC1    (18 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG2  (19 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG4  (20 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG1  (21 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG3  (22 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG5  (23 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG6  (24 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG7  (25 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG8  (26 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG9  (27 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_HRT1TRG10 (28 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_LPTIMOUT  (29 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T7TRGO    (30 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_RSVD1     (31 << ADC_CFGR1_EXTSEL_SHIFT) /* 11111: Reserved */
#define ADC_CFGR1_EXTEN_SHIFT          (10)                           /* Bits 10-11: External trigger/polarity selection regular channels */
#define ADC_CFGR1_EXTEN_MASK           (0x3 << ADC_CFGR1_EXTEN_SHIFT)
#  define ADC_CFGR1_EXTEN_NONE         (0x0 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection disabled */
#  define ADC_CFGR1_EXTEN_RISING       (0x1 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection on the rising edge */
#  define ADC_CFGR1_EXTEN_FALLING      (0x2 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection on the falling edge */
#  define ADC_CFGR1_EXTEN_BOTH         (0x3 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection on both edges */
#define ADC_CFGR1_OVRMOD               (1 << 12)                      /* Bit 12: Overrun Mode */
#define ADC_CFGR1_CONT                 (1 << 13)                      /* Bit 13: Continuous mode for regular conversions */
#define ADC_CFGR1_AUTDLY               (1 << 14)                      /* Bit 14: Delayed conversion mode */
#define ADC_CFGR1_ALIGN                (1 << 15)                      /* Bit 15: Data Alignment */
#define ADC_CFGR1_DISCEN               (1 << 16)                      /* Bit 16: Discontinuous mode for regular channels */
#define ADC_CFGR1_DISCNUM_SHIFT        (17)                           /* Bits 17-19: Discontinuous mode channel count */
#define ADC_CFGR1_DISCNUM_MASK         (0x7 << ADC_CFGR1_DISCNUM_SHIFT)
#  define ADC_CFGR1_DISCNUM(n)         (((n) - 1) << ADC_CFGR1_DISCNUM_SHIFT)
#  define ADC_CFGR1_DISCNUM_1          (0 << ADC_CFGR1_DISCNUM_SHIFT) /* 1 channel */
#  define ADC_CFGR1_DISCNUM_2          (1 << ADC_CFGR1_DISCNUM_SHIFT) /* 2 channels */
#  define ADC_CFGR1_DISCNUM_3          (2 << ADC_CFGR1_DISCNUM_SHIFT) /* 3 channels */
#  define ADC_CFGR1_DISCNUM_4          (3 << ADC_CFGR1_DISCNUM_SHIFT) /* 4 channels */
#  define ADC_CFGR1_DISCNUM_5          (4 << ADC_CFGR1_DISCNUM_SHIFT) /* 5 channels */
#  define ADC_CFGR1_DISCNUM_6          (5 << ADC_CFGR1_DISCNUM_SHIFT) /* 6 channels */
#  define ADC_CFGR1_DISCNUM_7          (6 << ADC_CFGR1_DISCNUM_SHIFT) /* 7 channels */
#  define ADC_CFGR1_DISCNUM_8          (7 << ADC_CFGR1_DISCNUM_SHIFT) /* 8 channels */
#define ADC_CFGR1_JDISCEN              (1 << 20)                      /* Bit 20: Discontinuous mode on injected channels */
#define ADC_CFGR1_JQM                  (1 << 21)                      /* Bit 21: JSQR queue mode */
#define ADC_CFGR1_AWD1SGL              (1 << 22)                      /* Bit 22: Enable watchdog on single/all channels */
#define ADC_CFGR1_AWD1EN               (1 << 23)                      /* Bit 23: Analog watchdog enable 1 regular channels */
#define ADC_CFGR1_JAWD1EN              (1 << 24)                      /* Bit 24: Analog watchdog enable 1 injected channels */
#define ADC_CFGR1_JAUTO                (1 << 25)                      /* Bit 25: Automatic injected group conversion */
#define ADC_CFGR1_AWD1CH_SHIFT         (26)                           /* Bits 26-30: Analog watchdog 1 channel select bits */
#define ADC_CFGR1_AWD1CH_MASK          (0x1f << ADC_CFGR1_AWD1CH_SHIFT)
#  define ADC_CFGR1_AWD1CH_DISABLED    (0 << ADC_CFGR1_AWD1CH_SHIFT)
#define ADC_CFGR1_JQDIS                (1 << 31)                      /* Bit 31: Injected queue disable */

/* ADC configuration register 2 (CFGR2) */

#define ADC_CFGR2_ROVSE                (1 << 0)                       /* Bit 0: Regular oversampling enable */
#define ADC_CFGR2_JOVSE                (1 << 1)                       /* Bit 1: Injected oversampling enable */
#define ADC_CFGR2_OVSR_SHIFT           (2)                            /* Bits 2-4: Oversampling ratio */
#define ADC_CFGR2_OVSR_MASK            (0x7 << ADC_CFGR2_OVSR_SHIFT)
#  define ADC_CFGR2_OVSR_2X            (0x0 << ADC_CFGR2_OVSR_SHIFT)  /* 000: 2x oversampling */
#  define ADC_CFGR2_OVSR_4X            (0x1 << ADC_CFGR2_OVSR_SHIFT)  /* 001: 4x oversampling */
#  define ADC_CFGR2_OVSR_8X            (0x2 << ADC_CFGR2_OVSR_SHIFT)  /* 010: 8x oversampling */
#  define ADC_CFGR2_OVSR_16X           (0x3 << ADC_CFGR2_OVSR_SHIFT)  /* 011: 16x oversampling */
#  define ADC_CFGR2_OVSR_32X           (0x4 << ADC_CFGR2_OVSR_SHIFT)  /* 100: 32x oversampling */
#  define ADC_CFGR2_OVSR_64X           (0x5 << ADC_CFGR2_OVSR_SHIFT)  /* 101: 64x oversampling */
#  define ADC_CFGR2_OVSR_128X          (0x6 << ADC_CFGR2_OVSR_SHIFT)  /* 110: 128x oversampling */
#  define ADC_CFGR2_OVSR_256X          (0x7 << ADC_CFGR2_OVSR_SHIFT)  /* 111: 256x oversampling */
#define ADC_CFGR2_OVSS_SHIFT           (5)                            /* Bits 5-8: Oversampling shift */
#define ADC_CFGR2_OVSS_MASK            (0xf << ADC_CFGR2_OVSS_SHIFT)
#  define ADC_CFGR2_OVSS(n)            ((n) << ADC_CFGR2_OVSS_SHIFT)
#  define ADC_CFGR2_OVSS_NONE          (0x0 << ADC_CFGR2_OVSS_SHIFT)  /* 0000: No shift  */
#  define ADC_CFGR2_OVSS_1_BIT         (0x1 << ADC_CFGR2_OVSS_SHIFT)  /* 0001: Shift 1 bits */
#  define ADC_CFGR2_OVSS_2_BIT         (0x2 << ADC_CFGR2_OVSS_SHIFT)  /* 0010: Shift 2 bits */
#  define ADC_CFGR2_OVSS_3_BIT         (0x3 << ADC_CFGR2_OVSS_SHIFT)  /* 0011: Shift 3 bits */
#  define ADC_CFGR2_OVSS_4_BIT         (0x4 << ADC_CFGR2_OVSS_SHIFT)  /* 0100: Shift 4 bits */
#  define ADC_CFGR2_OVSS_5_BIT         (0x5 << ADC_CFGR2_OVSS_SHIFT)  /* 0101: Shift 5 bits */
#  define ADC_CFGR2_OVSS_6_BIT         (0x6 << ADC_CFGR2_OVSS_SHIFT)  /* 0110: Shift 6 bits */
#  define ADC_CFGR2_OVSS_7_BIT         (0x7 << ADC_CFGR2_OVSS_SHIFT)  /* 0111: Shift 7 bits */
#  define ADC_CFGR2_OVSS_8_BIT         (0x8 << ADC_CFGR2_OVSS_SHIFT)  /* 1000: Shift 8 bits */
#define ADC_CFGR2_TROVS                (1 << 9)                       /* Bit 9: Triggered regular oversampling */
#define ADC_CFGR2_ROVSM                (1 << 10)                      /* Bit 10: Regular oversampling mode */
#define ADC_CFGR2_GCOMP                (1 << 16)                      /* Bit 16: Gain compensation mode */
#define ADC_CFGR2_SWTRIG               (1 << 25)                      /* Bit 25: Software trigger for sampling time control trigger mode */
#define ADC_CFGR2_BULB                 (1 << 26)                      /* Bit 26: Bulb sampling mode */
#define ADC_CFGR2_SMPTRIG              (1 << 27)                      /* Bit 27: Sampling time control trigger mode */

