apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2g4.h
/* ADC sample time values for use with SMPR1 and SMPR2 bitfields */

#define ADC_SMPR_2p5                   0x0                            /* 000: Sample for 2.5 cycles */
#define ADC_SMPR_6p5                   0x1                            /* 001: Sample for 6.5 cycles */
#define ADC_SMPR_12p5                  0x2                            /* 010: Sample for 12.5 cycles */
#define ADC_SMPR_24p5                  0x3                            /* 011: Sample for 24.5 cycles */
#define ADC_SMPR_47p5                  0x4                            /* 100: Sample for 47.5 cycles */
#define ADC_SMPR_92p5                  0x5                            /* 101: Sample for 92.5 cycles */
#define ADC_SMPR_247p5                 0x6                            /* 110: Sample for 247.5 cycles */
#define ADC_SMPR_640p5                 0x7                            /* 111: Sample for 640.5 cycles */

/* ADC sample time register 1 (SMPR1) */

#define ADC_SMPR1_SMP0_SHIFT           (0)                            /* Bits 0-2: Channel 0 Sample time selection */
#define ADC_SMPR1_SMP0_MASK            (0x7 << ADC_SMPR1_SMP1_SHIFT)
#define ADC_SMPR1_SMP1_SHIFT           (3)                            /* Bits 3-5: Channel 1 Sample time selection */
#define ADC_SMPR1_SMP1_MASK            (0x7 << ADC_SMPR1_SMP1_SHIFT)
#define ADC_SMPR1_SMP2_SHIFT           (6)                            /* Bits 6-8: Channel 2 Sample time selection */
#define ADC_SMPR1_SMP2_MASK            (0x7 << ADC_SMPR1_SMP2_SHIFT)
#define ADC_SMPR1_SMP3_SHIFT           (9)                            /* Bits 9-11: Channel 3 Sample time selection */
#define ADC_SMPR1_SMP3_MASK            (0x7 << ADC_SMPR1_SMP3_SHIFT)
#define ADC_SMPR1_SMP4_SHIFT           (12)                           /* Bits 12-14: Channel 4 Sample time selection */
#define ADC_SMPR1_SMP4_MASK            (0x7 << ADC_SMPR1_SMP4_SHIFT)
#define ADC_SMPR1_SMP5_SHIFT           (15)                           /* Bits 15-17: Channel 5 Sample time selection */
#define ADC_SMPR1_SMP5_MASK            (0x7 << ADC_SMPR1_SMP5_SHIFT)
#define ADC_SMPR1_SMP6_SHIFT           (18)                           /* Bits 18-20: Channel 6 Sample time selection */
#define ADC_SMPR1_SMP6_MASK            (0x7 << ADC_SMPR1_SMP6_SHIFT)
#define ADC_SMPR1_SMP7_SHIFT           (21)                           /* Bits 21-23: Channel 7 Sample time selection */
#define ADC_SMPR1_SMP7_MASK            (0x7 << ADC_SMPR1_SMP7_SHIFT)
#define ADC_SMPR1_SMP8_SHIFT           (24)                           /* Bits 24-26: Channel 8 Sample time selection */
#define ADC_SMPR1_SMP8_MASK            (0x7 << ADC_SMPR1_SMP8_SHIFT)
#define ADC_SMPR1_SMP9_SHIFT           (27)                           /* Bits 27-29: Channel 9 Sample time selection */
#define ADC_SMPR1_SMP9_MASK            (0x7 << ADC_SMPR1_SMP9_SHIFT)
#define ADC_SMPR1_SMPPLUS              (1 << 31)                      /* Bit 31: Addition of one clock cycle to the sampling time */

/* ADC sample time register 2 (SMPR2) */

#define ADC_SMPR2_SMP10_SHIFT          (0)                            /* Bits 0-2: Channel 10 Sample time selection */
#define ADC_SMPR2_SMP10_MASK           (0x7 << ADC_SMPR2_SMP10_SHIFT)
#define ADC_SMPR2_SMP11_SHIFT          (3)                            /* Bits 3-5: Channel 11 Sample time selection */
#define ADC_SMPR2_SMP11_MASK           (0x7 << ADC_SMPR2_SMP11_SHIFT)
#define ADC_SMPR2_SMP12_SHIFT          (6)                            /* Bits 6-8: Channel 12 Sample time selection */
#define ADC_SMPR2_SMP12_MASK           (0x7 << ADC_SMPR2_SMP12_SHIFT)
#define ADC_SMPR2_SMP13_SHIFT          (9)                            /* Bits 9-11: Channel 13 Sample time selection */
#define ADC_SMPR2_SMP13_MASK           (0x7 << ADC_SMPR2_SMP13_SHIFT)
#define ADC_SMPR2_SMP14_SHIFT          (12)                           /* Bits 12-14: Channel 14 Sample time selection */
#define ADC_SMPR2_SMP14_MASK           (0x7 << ADC_SMPR2_SMP14_SHIFT)
#define ADC_SMPR2_SMP15_SHIFT          (15)                           /* Bits 15-17: Channel 15 Sample time selection */
#define ADC_SMPR2_SMP15_MASK           (0x7 << ADC_SMPR2_SMP15_SHIFT)
#define ADC_SMPR2_SMP16_SHIFT          (18)                           /* Bits 18-20: Channel 16 Sample time selection */
#define ADC_SMPR2_SMP16_MASK           (0x7 << ADC_SMPR2_SMP16_SHIFT)
#define ADC_SMPR2_SMP17_SHIFT          (21)                           /* Bits 21-23: Channel 17 Sample time selection */
#define ADC_SMPR2_SMP17_MASK           (0x7 << ADC_SMPR2_SMP17_SHIFT)
#define ADC_SMPR2_SMP18_SHIFT          (24)                           /* Bits 24-26: Channel 18 Sample time selection */
#define ADC_SMPR2_SMP18_MASK           (0x7 << ADC_SMPR2_SMP18_SHIFT)

/* ADC watchdog threshold register 1 (TR1) */

#define ADC_TR1_LT_SHIFT               (0)                            /* Bits 0-11: Analog watchdog 1 lower threshold */
#define ADC_TR1_LT_MASK                (0xfff << ADC_TR1_LT_SHIFT)
#define ADC_TR1_AWDFILT_SHIFT          (12)                           /* Bits 12-14: Analog watchdog filtering parameter */
#define ADC_TR1_AWDFILT_MASK           (0x7 << ADC_TR1_AWDFILT_SHIFT)
#  define ADC_TR1_AWDFILT(n)           (((n) - 1) << ADC_TR1_AWDFILT_SHIFT)
#  define ADC_TR1_AWDFILT_NONE         (0x0 << ADC_TR1_AWDFILT_SHIFT) /* 000: No filtering */
#  define ADC_TR1_AWDFILT_2            (0x1 << ADC_TR1_AWDFILT_SHIFT) /* 001: Two consecutive detections generate an AWDx flag or interrupt */
#  define ADC_TR1_AWDFILT_3            (0x2 << ADC_TR1_AWDFILT_SHIFT) /* 010: Three consecutive detections generate an AWDx flag or interrupt */
#  define ADC_TR1_AWDFILT_4            (0x3 << ADC_TR1_AWDFILT_SHIFT) /* 011: Four consecutive detections generate an AWDx flag or interrupt */
#  define ADC_TR1_AWDFILT_5            (0x4 << ADC_TR1_AWDFILT_SHIFT) /* 100: Five consecutive detections generate an AWDx flag or interrupt */
#  define ADC_TR1_AWDFILT_6            (0x5 << ADC_TR1_AWDFILT_SHIFT) /* 101: Six consecutive detections generate an AWDx flag or interrupt */
#  define ADC_TR1_AWDFILT_7            (0x6 << ADC_TR1_AWDFILT_SHIFT) /* 110: Seven consecutive detections generate an AWDx flag or interrupt */
#  define ADC_TR1_AWDFILT_8            (0x7 << ADC_TR1_AWDFILT_SHIFT) /* 111: Eight consecutive detections generate an AWDx flag or interrupt */
#define ADC_TR1_HT_SHIFT               (16)                           /* Bits 16-27: Analog watchdog 1 higher threshold */
#define ADC_TR1_HT_MASK                (0xfff << ADC_TR1_HT_SHIFT)

/* ADC watchdog threshold register 2 (TR2) */

#define ADC_TR2_LT_SHIFT               (0)                            /* Bits 0-7: Analog watchdog 2 lower threshold */
#define ADC_TR2_LT_MASK                (0xff << ADC_TR2_LT_SHIFT)
#define ADC_TR2_HT_SHIFT               (16)                           /* Bits 16-23: Analog watchdog 2 higher threshold */
#define ADC_TR2_HT_MASK                (0xff << ADC_TR2_HT_SHIFT)

