apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2g4.h
/* ADC watchdog threshold register 3 (TR3) */

#define ADC_TR3_LT_SHIFT               (0)                            /* Bits 0-7: Analog watchdog 3 lower threshold */
#define ADC_TR3_LT_MASK                (0xff << ADC_TR3_LT_SHIFT)
#define ADC_TR3_HT_SHIFT               (16)                           /* Bits 16-23: Analog watchdog 3 higher threshold */
#define ADC_TR3_HT_MASK                (0xff << ADC_TR3_HT_SHIFT)

/* ADC regular sequence register 1 (SQR1) */

#define ADC_SQ_OFFSET                  (6)                            /* Offset between SQ bitfields in SQR1..SQR4 */

#define ADC_SQR1_L_SHIFT               (0)                            /* Bits 0-3:   Regular channel sequence length */
#define ADC_SQR1_L_MASK                (0x0f << ADC_SQR1_L_SHIFT)
#  define ADC_SQR1_L(n)                (((n) - 1) << ADC_SQR1_L_SHIFT)
#  define ADC_SQR1_L_1                 (0x0 << ADC_SQR1_L_SHIFT)      /* 1 conversion */
#  define ADC_SQR1_L_2                 (0x1 << ADC_SQR1_L_SHIFT)      /* 2 conversions */
#  define ADC_SQR1_L_3                 (0x2 << ADC_SQR1_L_SHIFT)      /* 3 conversions */
#  define ADC_SQR1_L_4                 (0x3 << ADC_SQR1_L_SHIFT)      /* 4 conversions */
#  define ADC_SQR1_L_5                 (0x4 << ADC_SQR1_L_SHIFT)      /* 5 conversion */
#  define ADC_SQR1_L_6                 (0x5 << ADC_SQR1_L_SHIFT)      /* 6 conversions */
#  define ADC_SQR1_L_7                 (0x6 << ADC_SQR1_L_SHIFT)      /* 7 conversions */
#  define ADC_SQR1_L_8                 (0x7 << ADC_SQR1_L_SHIFT)      /* 8 conversions */
#  define ADC_SQR1_L_9                 (0x8 << ADC_SQR1_L_SHIFT)      /* 9 conversion */
#  define ADC_SQR1_L_10                (0x9 << ADC_SQR1_L_SHIFT)      /* 10 conversions */
#  define ADC_SQR1_L_11                (0xa << ADC_SQR1_L_SHIFT)      /* 11 conversions */
#  define ADC_SQR1_L_12                (0xb << ADC_SQR1_L_SHIFT)      /* 12 conversions */
#  define ADC_SQR1_L_13                (0xc << ADC_SQR1_L_SHIFT)      /* 13 conversion */
#  define ADC_SQR1_L_14                (0xd << ADC_SQR1_L_SHIFT)      /* 14 conversions */
#  define ADC_SQR1_L_15                (0xe << ADC_SQR1_L_SHIFT)      /* 15 conversions */
#  define ADC_SQR1_L_16                (0xf << ADC_SQR1_L_SHIFT)      /* 16 conversions */
#define ADC_SQR1_SQ1_SHIFT             (6)                            /* Bits 6-10:  1st conversion in regular sequence */
#define ADC_SQR1_SQ1_MASK              (0x1f << ADC_SQR1_SQ1_SHIFT)
#define ADC_SQR1_SQ2_SHIFT             (12)                           /* Bits 12-16: 2nd conversion in regular sequence */
#define ADC_SQR1_SQ2_MASK              (0x1f << ADC_SQR1_SQ2_SHIFT)
#define ADC_SQR1_SQ3_SHIFT             (18)                           /* Bits 18-22: 3rd conversion in regular sequence */
#define ADC_SQR1_SQ3_MASK              (0x1f << ADC_SQR1_SQ3_SHIFT)
#define ADC_SQR1_SQ4_SHIFT             (24)                           /* Bits 24-28: 4th conversion in regular sequence */
#define ADC_SQR1_SQ4_MASK              (0x1f << ADC_SQR1_SQ4_SHIFT)
#define ADC_SQR1_RESERVED              (0xe0820830)                   /* Mask of all reserved bits: 4, 5, 11, 17, 23, 29, 30, 31 */
#define ADC_SQR1_FIRST                 (1)
#define ADC_SQR1_LAST                  (4)
#define ADC_SQR1_SQ_OFFSET             (1 * ADC_SQ_OFFSET)            /* Offset to first SQ bitfield in the register */

/* ADC regular sequence register 2 (SQR2) */

#define ADC_SQR2_SQ5_SHIFT             (0)                            /* Bits 0-4:   5th conversion in regular sequence */
#define ADC_SQR2_SQ5_MASK              (0x1f << ADC_SQR2_SQ5_SHIFT)
#define ADC_SQR2_SQ6_SHIFT             (6)                            /* Bits 6-10:  6th conversion in regular sequence */
#define ADC_SQR2_SQ6_MASK              (0x1f << ADC_SQR2_SQ6_SHIFT)
#define ADC_SQR2_SQ7_SHIFT             (12)                           /* Bits 12-16: 7th conversion in regular sequence */
#define ADC_SQR2_SQ7_MASK              (0x1f << ADC_SQR2_SQ7_SHIFT)
#define ADC_SQR2_SQ8_SHIFT             (18)                           /* Bits 18-22: 8th conversion in regular sequence */
#define ADC_SQR2_SQ8_MASK              (0x1f << ADC_SQR2_SQ8_SHIFT)
#define ADC_SQR2_SQ9_SHIFT             (24)                           /* Bits 24-28: 9th conversion in regular sequence */
#define ADC_SQR2_SQ9_MASK              (0x1f << ADC_SQR2_SQ9_SHIFT)
#define ADC_SQR2_RESERVED              (0xe0820820)                   /* Mask of all reserved bits: 5, 11, 17, 23, 29, 30, 31 */
#define ADC_SQR2_FIRST                 (5)
#define ADC_SQR2_LAST                  (9)
#define ADC_SQR2_SQ_OFFSET             (0)                            /* Offset to first SQ bitfield in the register */

/* ADC regular sequence register 3 (SQR3) */

#define ADC_SQR3_SQ10_SHIFT            (0)                            /* Bits 0-4:   10th conversion in regular sequence */
#define ADC_SQR3_SQ10_MASK             (0x1f << ADC_SQR3_SQ10_SHIFT)
#define ADC_SQR3_SQ11_SHIFT            (6)                            /* Bits 6-10:  11th conversion in regular sequence */
#define ADC_SQR3_SQ11_MASK             (0x1f << ADC_SQR3_SQ11_SHIFT)
#define ADC_SQR3_SQ12_SHIFT            (12)                           /* Bits 12-16: 12th conversion in regular sequence */
#define ADC_SQR3_SQ12_MASK             (0x1f << ADC_SQR3_SQ12_SHIFT)
#define ADC_SQR3_SQ13_SHIFT            (18)                           /* Bits 18-22: 13th conversion in regular sequence */
#define ADC_SQR3_SQ13_MASK             (0x1f << ADC_SQR3_SQ13_SHIFT)
#define ADC_SQR3_SQ14_SHIFT            (24)                           /* Bits 24-28: 14th conversion in regular sequence */
#define ADC_SQR3_SQ14_MASK             (0x1f << ADC_SQR3_SQ14_SHIFT)
#define ADC_SQR3_RESERVED              (0xe0820820)                   /* Mask of all reserved bits: 5, 11, 17, 23, 29, 30, 31 */
#define ADC_SQR3_FIRST                 (10)
#define ADC_SQR3_LAST                  (14)
#define ADC_SQR3_SQ_OFFSET             (0)                            /* Offset to first SQ bitfield in the register */

/* ADC regular sequence register 4 (SQR4) */

#define ADC_SQR4_SQ15_SHIFT            (0)                            /* Bits 0-4:   15th conversion in regular sequence */
#define ADC_SQR4_SQ15_MASK             (0x1f << ADC_SQR4_SQ15_SHIFT)
#define ADC_SQR4_SQ16_SHIFT            (6)                            /* Bits 6-10:  16th conversion in regular sequence */
#define ADC_SQR4_SQ16_MASK             (0x1f << ADC_SQR4_SQ16_SHIFT)
#define ADC_SQR4_RESERVED              (0xfffff820)                   /* Mask of all reserved bits: 5, 11-31 */
#define ADC_SQR4_FIRST                 (15)
#define ADC_SQR4_LAST                  (16)
#define ADC_SQR4_SQ_OFFSET             (0)                            /* Offset to first SQ bitfield in the register */

