apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2g4.h
#define ADC_JDR_JDATA_SHIFT            (0)
#define ADC_JDR_JDATA_MASK             (0xffff << ADC_JDR_JDATA_SHIFT)

/* ADC analog watchdog 2 configuration register (AWD2CR) */

#define ADC_AWD2CR_CH_SHIFT            (0)                            /* Bits 0-18: Analog watchdog 2 channel selection */
#define ADC_AWD2CR_CH_MASK             (0x7ffff << ADC_AWD2CR_CH_SHIFT)
#  define ADC_AWD2CR_CH(n)             (1 << (n))                     /* Channel n=0..18 */

/* ADC analog watchdog 3 configuration register (AWD3CR) */

#define ADC_AWD3CR_CH_SHIFT            (0)                            /* Bits 0-18: Analog watchdog 3 channel selection */
#define ADC_AWD3CR_CH_MASK             (0x7ffff << ADC_AWD3CR_CH_SHIFT)
#  define ADC_AWD3CR_CH(n)             (1 << (n))                     /* Channel n=0..18 */

/* ADC differential mode selection register (DIFSEL) */

#define ADC_DIFSEL_CH_SHIFT            (0)                            /* Bits 0-18: Differential mode selection */
#define ADC_DIFSEL_CH_MASK             (0x7ffff << ADC_DIFSEL_CH_SHIFT)
#  define ADC_DIFSEL_CH(n)             (1 << (n))                     /* Channel n=0..18 */

/* ADC calibration factors register (CALFACT) */

#define ADC_CALFACT_S_SHIFT            (0)                            /* Bits 0-6: Calibration factors in single-ended mode */
#define ADC_CALFACT_S_MASK             (0x7f << ADC_CALFACT_S_SHIFT)
#define ADC_CALFACT_D_SHIFT            (16)                           /* Bits 16-22: Calibration factors in differential mode */
#define ADC_CALFACT_D_MASK             (0x7f << ADC_CALFACT_D_SHIFT)

/* ADC gain compensation register (GCOMP) */

#define ADC_GCOMP_SHIFT                (0)                            /* Bits 0-13: Gain compensation coefficient */
#define ADC_GCOMP_MASK                 (0x3fff << ADC_GCOMP_SHIFT)

/* ADC12, ADC345 - Common status register (CSR) */

#define ADC_CSR_ADRDY_MST              (1 << 0)                       /* Bit 0: Master ADC ready */
#define ADC_CSR_EOSMP_MST              (1 << 1)                       /* Bit 1: End of Sampling phase flag (master ADC) */
#define ADC_CSR_EOC_MST                (1 << 2)                       /* Bit 2: End of regular conversion (master ADC) */
#define ADC_CSR_EOS_MST                (1 << 3)                       /* Bit 3: End of regular sequence flag (master ADC) */
#define ADC_CSR_OVR_MST                (1 << 4)                       /* Bit 4: Overrun flag (master ADC) */
#define ADC_CSR_JEOC_MST               (1 << 5)                       /* Bit 5: End of injected conversion flag (master ADC) */
#define ADC_CSR_JEOS_MST               (1 << 6)                       /* Bit 6: End of injected sequence flag (master ADC) */
#define ADC_CSR_AWD1_MST               (1 << 7)                       /* Bit 7: Analog watchdog 1 flag (master ADC) */
#define ADC_CSR_AWD2_MST               (1 << 8)                       /* Bit 8: Analog watchdog 2 flag (master ADC) */
#define ADC_CSR_AWD3_MST               (1 << 9)                       /* Bit 9: Analog watchdog 3 flag (master ADC) */
#define ADC_CSR_JQOVF_MST              (1 << 10)                      /* Bit 10: Injected Context Queue Overflow flag (master ADC) */
#define ADC_CSR_ADRDY_SLV              (1 << 16)                      /* Bit 16: Slave ADC ready */
#define ADC_CSR_EOSMP_SLV              (1 << 17)                      /* Bit 17: End of Sampling phase flag (slave ADC) */
#define ADC_CSR_EOC_SLV                (1 << 18)                      /* Bit 18: End of regular conversion (slave ADC) */
#define ADC_CSR_EOS_SLV                (1 << 19)                      /* Bit 19: End of regular sequence flag (slave ADC) */
#define ADC_CSR_OVR_SLV                (1 << 20)                      /* Bit 20: Overrun flag (slave ADC) */
#define ADC_CSR_JEOC_SLV               (1 << 21)                      /* Bit 21: End of injected conversion flag (slave ADC) */
#define ADC_CSR_JEOS_SLV               (1 << 22)                      /* Bit 22: End of injected sequence flag (slave ADC) */
#define ADC_CSR_AWD1_SLV               (1 << 23)                      /* Bit 23: Analog watchdog 1 flag (slave ADC) */
#define ADC_CSR_AWD2_SLV               (1 << 24)                      /* Bit 24: Analog watchdog 2 flag (slave ADC) */
#define ADC_CSR_AWD3_SLV               (1 << 25)                      /* Bit 25: Analog watchdog 3 flag (slave ADC) */
#define ADC_CSR_JQOVF_SLV              (1 << 26)                      /* Bit 26: Injected Context Queue Overflow flag (slave ADC) */

/* ADC12, ADC345 - Common control register (CCR) */

#define ADC_CCR_DUAL_SHIFT             (0)                            /* Bits 0-4: Dual ADC mode selection */
#define ADC_CCR_DUAL_MASK              (0x1f << ADC_CCR_DUAL_SHIFT)
#  define ADC_CCR_DUAL_IND             (0x0 << ADC_CCR_DUAL_SHIFT)    /* 00000: Independent mode */
#  define ADC_CCR_DUAL_DUAL            (0x1 << ADC_CCR_DUAL_SHIFT)    /* 00001: Dual mode, master/slave ADCs together */
#  define ADC_CCR_DUAL_SIMINJ          (0x1 << ADC_CCR_DUAL_SHIFT)    /* 00001: Combined regular sim. + injected sim. */
#  define ADC_CCR_DUAL_SIMALT          (0x2 << ADC_CCR_DUAL_SHIFT)    /* 00010: Combined regular sim. + alternate trigger */
#  define ADC_CCR_DUAL_INTINJ          (0x3 << ADC_CCR_DUAL_SHIFT)    /* 00011: Combined interl. mode + injected sim. */
#  define ADC_CCR_DUAL_INJECTED        (0x5 << ADC_CCR_DUAL_SHIFT)    /* 00101: Injected simultaneous mode only */
#  define ADC_CCR_DUAL_SIM             (0x6 << ADC_CCR_DUAL_SHIFT)    /* 00110: Regular simultaneous mode only */
#  define ADC_CCR_DUAL_INTERLEAVE      (0x7 << ADC_CCR_DUAL_SHIFT)    /* 00111: Interleaved mode only */
#  define ADC_CCR_DUAL_ALT             (0x9 << ADC_CCR_DUAL_SHIFT)    /* 01001: Alternate trigger mode only */
#define ADC_CCR_DELAY_SHIFT            (8)                            /* Bits 8-11: Delay between 2 sampling phases */
#define ADC_CCR_DELAY_MASK             (0xf << ADC_CCR_DELAY_SHIFT)   /* n * TADCCLK, 1-13 */
#  define ADC_CCR_DELAY(n)             (((n) - 1) << ADC_CCR_DELAY_SHIFT)
#define ADC_CCR_DMACFG                 (1 << 13)                      /* Bit 13: DMA configuration (for dual ADC mode) */
#define ADC_CCR_MDMA_SHIFT             (14)                           /* Bits 14-15: Direct memory access mode for dual ADC mode */
#define ADC_CCR_MDMA_MASK              (0x3 << ADC_CCR_MDMA_SHIFT)
#  define ADC_CCR_MDMA_DISABLED        (0x0 << ADC_CCR_MDMA_SHIFT)    /* MDMA mode disabled */
#  define ADC_CCR_MDMA_10_12           (0x2 << ADC_CCR_MDMA_SHIFT)    /* MDMA mode enabled (12 / 10-bit) */
#  define ADC_CCR_MDMA_6_8             (0x3 << ADC_CCR_MDMA_SHIFT)    /* MDMA mode enabled (8 / 6-bit) */
#define ADC_CCR_CKMODE_SHIFT           (16)                           /* Bits 16-17: ADC clock mode */
#define ADC_CCR_CKMODE_MASK            (0x3 << ADC_CCR_CKMODE_SHIFT)
#  define ADC_CCR_CKMODE_ASYNCH        (0x0 << ADC_CCR_CKMODE_SHIFT)  /* Asynchronous clock mode */
#  define ADC_CCR_CKMODE_SYNCH_DIV1    (0x1 << ADC_CCR_CKMODE_SHIFT)  /* Synchronous clock mode divided by 1 */
#  define ADC_CCR_CKMODE_SYNCH_DIV2    (0x2 << ADC_CCR_CKMODE_SHIFT)  /* Synchronous clock mode divided by 2 */
#  define ADC_CCR_CKMODE_SYNCH_DIV4    (0x3 << ADC_CCR_CKMODE_SHIFT)  /* Synchronous clock mode divided by 4 */
#define ADC_CCR_PRESC_SHIFT            (18)                           /* Bits 18-21: ADC prescaler */
#define ADC_CCR_PRESC_MASK             (0xf << ADC_CCR_PRESC_SHIFT)
#  define ADC_CCR_PRESC_1              (0x0 << ADC_CCR_PRESC_SHIFT)   /* 0000: Input ADC clock not divided */
#  define ADC_CCR_PRESC_2              (0x1 << ADC_CCR_PRESC_SHIFT)   /* 0001: Input ADC clock divided by 2 */
#  define ADC_CCR_PRESC_4              (0x2 << ADC_CCR_PRESC_SHIFT)   /* 0010: Input ADC clock divided by 4 */
#  define ADC_CCR_PRESC_6              (0x3 << ADC_CCR_PRESC_SHIFT)   /* 0011: Input ADC clock divided by 6 */
#  define ADC_CCR_PRESC_8              (0x4 << ADC_CCR_PRESC_SHIFT)   /* 0100: Input ADC clock divided by 8 */
#  define ADC_CCR_PRESC_10             (0x5 << ADC_CCR_PRESC_SHIFT)   /* 0101: Input ADC clock divided by 10 */
#  define ADC_CCR_PRESC_12             (0x6 << ADC_CCR_PRESC_SHIFT)   /* 0110: Input ADC clock divided by 12 */
#  define ADC_CCR_PRESC_16             (0x7 << ADC_CCR_PRESC_SHIFT)   /* 0111: Input ADC clock divided by 16 */
#  define ADC_CCR_PRESC_32             (0x8 << ADC_CCR_PRESC_SHIFT)   /* 1000: Input ADC clock divided by 32 */
#  define ADC_CCR_PRESC_64             (0x9 << ADC_CCR_PRESC_SHIFT)   /* 1001: Input ADC clock divided by 64 */
#  define ADC_CCR_PRESC_128            (0xa << ADC_CCR_PRESC_SHIFT)   /* 1010: Input ADC clock divided by 128 */
#  define ADC_CCR_PRESC_256            (0xb << ADC_CCR_PRESC_SHIFT)   /* 1011: Input ADC clock divided by 256 */
#define ADC_CCR_VREFEN                 (1 << 22)                      /* Bit 22: VREFINT enable */
#define ADC_CCR_TSEN                   (1 << 23)                      /* Bit 23: Temperature sensor enable */
#define ADC_CCR_VBATEN                 (1 << 24)                      /* Bit 24: VBAT enable */

/* Common regular data register for dual mode */

#define ADC_CDR_RDATA_MST_SHIFT        (0)                            /* Bits 0-15: Regular data of the Master ADC */
#define ADC_CDR_RDATA_MST_MASK         (0xffff << ADC_CDR_RDATA_MST_SHIFT)
#define ADC_CDR_RDATA_SLV_SHIFT        (16)                           /* Bits 16-31: Regular data of the Slave ADC */
#define ADC_CDR_RDATA_SLV_MASK         (0xffff << ADC_CDR_RDATA_SLV_SHIFT)

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_ADC_V2G4_H */
